Autodesk.Revit.UI.TextEditorOptions.GetTextEditorOptions
Returns the current Revit instance's TextEditorOptions.
Returns:
The TextEditorOptions for the current Revit instance.
Since:
2017

Autodesk.Revit.UI.TextEditorOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.TextEditorOptions.ShowOpaqueBackground
Show opaque background behind the text during editing.
Remarks:
If false, the background will be opaque or not depending on the edited text note's type Background setting.
If true, the background behind the text will always be opaque during editing.
Since:
2017

Autodesk.Revit.UI.TextEditorOptions.ShowBorder
Show the border box around the text during editing.
Remarks:
If false, the border will appear or not depending on the edited text note's type Show Border setting.
If true, the border will always appear during editing regardless of type settings.
Since:
2017

Autodesk.Revit.UI.TextEditorOptions
Provides access to settings that control Revit's Text Editor appearance and functionality.
Remarks:
These settings are stored in the Revit.ini file.  All documents in Revit instances which use this Revit.ini will follow these settings.
Since:
2017